---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.UnexpectedCurveIntersectionFailure
source: html/44612735-2abd-a312-1967-d80967b0dd8b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.UnexpectedCurveIntersectionFailure Property

Computing curve intersection and find the invalid result.

## Syntax (C#)
```csharp
public static FailureDefinitionId UnexpectedCurveIntersectionFailure { get; }
```